//Написать программу, вводящую три целых числа и выводящую новое число,
//каждый бит которого равен тому значению, которое встречается чаще 
//среди битов с таким же номером у введенных чисел.

using System;

class Program
{
    static void Main(string[] args)
    {
        // Ввод трёх целых чисел
        Console.Write("Введите a: ");
        int number1 = Convert.ToInt32(Console.ReadLine());

        Console.Write("Введите b: ");
        int number2 = Convert.ToInt32(Console.ReadLine());

        Console.Write("Введите c: ");
        int number3 = Convert.ToInt32(Console.ReadLine());

        // Переменная для нового числа
        int newNumber = 0;

        // Обработка каждого бита
        for (int bitPosition = 0; bitPosition < 32; bitPosition++)
        {
            // Подсчёт количества единиц и нулей 
            int count1 = (number1 >> bitPosition) & 1; // бит в первом числе
            int count2 = (number2 >> bitPosition) & 1; //  бит во втором числе
            int count3 = (number3 >> bitPosition) & 1; //  бит в третьем числе

            // Сложение 
            int onesCount = count1 + count2 + count3;
            
            // Если единиц больше или равно половине, ставим 1, иначе ставим 0
            if (onesCount >= 2) // Если 2 или 3 единицы, то записываем 1
            {
                newNumber |= (1 << bitPosition); // бит в новое число
            }
        }

        // Вывод
        Console.WriteLine($"Новое число: {newNumber}");
    }
}